IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ECAP8_CONTROLSS_ECAP8.xml
	<register id="CONTROLSS_ECAP8_ECFLG" acronym="CONTROLSS_ECAP8_ECFLG" offset="0x2E" width="16" description="">
		<bitfield id="MUNIT_2_ERROR_EVT2" width="1" begin="12" end="12" resetval="0x0" description="Error event 2 Interrupt Flag from monitoring unit 2" range="12" rwaccess="RO"/> 
		<bitfield id="MUNIT_2_ERROR_EVT1" width="1" begin="11" end="11" resetval="0x0" description="Error event 2 Interrupt Flag from monitoring unit 2" range="11" rwaccess="RO"/> 
		<bitfield id="MUNIT_1_ERROR_EVT2" width="1" begin="10" end="10" resetval="0x0" description="Error event 2 Interrupt Flag from monitoring unit 1" range="10" rwaccess="RO"/> 
		<bitfield id="MUNIT_1_ERROR_EVT1" width="1" begin="9" end="9" resetval="0x0" description="Error event 2 Interrupt Flag from monitoring unit 1" range="9" rwaccess="RO"/> 
		<bitfield id="HRERROR" width="1" begin="8" end="8" resetval="0x0" description="High resolution error status flag    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_HIGH_RESOLUTION_ERRORIndicates the High resolution Error occurred  " range="8" rwaccess="RO"/> 
		<bitfield id="CTR_CMP" width="1" begin="7" end="7" resetval="0x0" description="Compare Equal Compare Status Flag. This flag is active only in APWM mode.    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_COUNTER_COMPARE_REGIndicates the counter (TSCTR) reached the compare register value (ACMP)  " range="7" rwaccess="RO"/> 
		<bitfield id="CTR_PRD" width="1" begin="6" end="6" resetval="0x0" description="Counter Equal Period Status Flag. This flag is only active in APWM mode.    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_PERIOD_VALUE_RESETIndicates the counter (TSCTR) reached the period register value (APRD) and was reset.  " range="6" rwaccess="RO"/> 
		<bitfield id="CTROVF" width="1" begin="5" end="5" resetval="0x0" description="Counter Overflow Status Flag. This flag is active in CAP and APWM mode.    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_COUNTER_TRANSIndicates the counter (TSCTR) has made the transition from FFFFFFFF to 00000000  " range="5" rwaccess="RO"/> 
		<bitfield id="CEVT4" width="1" begin="4" end="4" resetval="0x0" description="Capture Event 4 Status Flag This flag is only active in CAP mode.    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_4TH_EVENT_ECAPXIndicates the fourth event occurred at ECAPx pin  " range="4" rwaccess="RO"/> 
		<bitfield id="CEVT3" width="1" begin="3" end="3" resetval="0x0" description="Capture Event 3 Status Flag. This flag is active only in CAP mode.    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_3RD_EVENT_ECAPXIndicates the third event occurred at ECAPx pin.  " range="3" rwaccess="RO"/> 
		<bitfield id="CEVT2" width="1" begin="2" end="2" resetval="0x0" description="Capture Event 2 Status Flag. This flag is only active in CAP mode.    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_2ND_EVENT_ECAPXIndicates the second event occurred at ECAPx pin.  " range="2" rwaccess="RO"/> 
		<bitfield id="CEVT1" width="1" begin="1" end="1" resetval="0x0" description="Capture Event 1 Status Flag. This flag is only active in CAP mode.    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_1ST_EVENT_ECAPXIndicates the first event occurred at ECAPx pin.  " range="1" rwaccess="RO"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="Global Interrupt Status Flag    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_INTERRUPTIndicates that an interrupt was generated.  " range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP8_ECCLR" acronym="CONTROLSS_ECAP8_ECCLR" offset="0x30" width="16" description="">
		<bitfield id="MUNIT_2_ERROR_EVT2" width="1" begin="12" end="12" resetval="0x0" description="Writing '1' clears MUNIT_2_ERROR_EVT2 interrupt flag" range="12" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="MUNIT_2_ERROR_EVT1" width="1" begin="11" end="11" resetval="0x0" description="Writing '1' clears MUNIT_2_ERROR_EVT1 interrupt flag" range="11" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="MUNIT_1_ERROR_EVT2" width="1" begin="10" end="10" resetval="0x0" description="Writing '1' clears MUNIT_1_ERROR_EVT2 interrupt flag" range="10" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="MUNIT_1_ERROR_EVT1" width="1" begin="9" end="9" resetval="0x0" description="Writing '1' clears MUNIT_1_ERROR_EVT1 interrupt flag" range="9" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="HRERROR" width="1" begin="8" end="8" resetval="0x0" description="High resolution error status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_HRERRORWriting a 1 clears the HRERROR flag.  " range="8" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CTR_CMP" width="1" begin="7" end="7" resetval="0x0" description="Counter Equal Compare Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_CTR_CMPWriting a 1 clears the CTR=CMP flag.  " range="7" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CTR_PRD" width="1" begin="6" end="6" resetval="0x0" description="Counter Equal Period Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_CTR_PRDWriting a 1 clears the CTR=PRD flag.  " range="6" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CTROVF" width="1" begin="5" end="5" resetval="0x0" description="Counter Overflow Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_CTROVFWriting a 1 clears the CTROVF flag.  " range="5" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CEVT4" width="1" begin="4" end="4" resetval="0x0" description="Capture Event 4 Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_CEVT4Writing a 1 clears the CEVT4 flag.  " range="4" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CEVT3" width="1" begin="3" end="3" resetval="0x0" description="Capture Event 3 Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_CEVT3Writing a 1 clears the CEVT3 flag.  " range="3" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CEVT2" width="1" begin="2" end="2" resetval="0x0" description="Capture Event 2 Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_CEVT2Writing a 1 clears the CEVT2 flag.  " range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CEVT1" width="1" begin="1" end="1" resetval="0x0" description="Capture Event 1 Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_CEVT1Writing a 1 clears the CEVT1 flag.  " range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="ECAP Global Interrupt Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_INTWriting a 1 clears the INT flag and enable further interrupts to be generated if any of the event flags are set to 1  " range="0" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
