IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ECAP8_CONTROLSS_ECAP8.xml
	<register id="CONTROLSS_ECAP8_MUNIT_2_MIN_SHADOW" acronym="CONTROLSS_ECAP8_MUNIT_2_MIN_SHADOW" offset="0x118" width="32" description="">
		<bitfield id="MIN_VALUE_SHADOW" width="32" begin="31" end="0" resetval="0x0" description="Shadow minimum value for monitoring. Shadow value is loaded to active register on Sync event or global load strobe." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP8_MUNIT_2_MAX_SHADOW" acronym="CONTROLSS_ECAP8_MUNIT_2_MAX_SHADOW" offset="0x11C" width="32" description="">
		<bitfield id="MAX_VALUE_SHADOW" width="32" begin="31" end="0" resetval="0x0" description="Shadow maximum value for monitoring. Shadow value is loaded to active register on Sync event or global load strobe." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP8_MUNIT_2_DEBUG_RANGE_MIN" acronym="CONTROLSS_ECAP8_MUNIT_2_DEBUG_RANGE_MIN" offset="0x120" width="32" description="">
		<bitfield id="MIN_VALUE" width="32" begin="31" end="0" resetval="0x4294967295" description="Observed Min value of check being enabled on minotoring unit 2. Is updated when MUNIT_2_CTL.DEBUG_RANGE_EN is set to '1'" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP8_MUNIT_2_DEBUG_RANGE_MAX" acronym="CONTROLSS_ECAP8_MUNIT_2_DEBUG_RANGE_MAX" offset="0x124" width="32" description="">
		<bitfield id="MAX_VALUE" width="32" begin="31" end="0" resetval="0x0" description="Observed Min value of check being enabled on minotoring unit 2. Is updated when MUNIT_2_CTL.DEBUG_RANGE_EN is set to '1'" range="31 - 0" rwaccess="RO"/>
	</register>
</module>